Revit 2027 API
BuiltInFailures.EditingFailures.DeletePreventedByGroup Property
 Grouped elements can only be deleted when the group is being edited. To delete a member select the group and then click the Edit Group button on the toolbar, then delete the member.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId DeletePreventedByGroup { get; }
Public Shared ReadOnly Property DeletePreventedByGroup As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ DeletePreventedByGroup {
	FailureDefinitionId^ get ();
}
static member DeletePreventedByGroup : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.EditingFailures Class
Autodesk.Revit.DB Namespace